src/Catalogs/НСИОбъектыДляКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НСИОбъектыДляКонтроля</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеВСистемеКонтролере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НСИТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаКонтролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИИспользуемыеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НСИРежимыКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьGUIDЗаписьюЭлемента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление1</Name>
					<Comment>LX добавлено для </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДляКонтроляРодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИОбъектыДляКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СистемыПользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Система</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НСИИспользуемыеСистемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отбор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКлючаПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоляВКонтролере</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GUID</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/НСИТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>НСИТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перечисление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/НСИОбъектыДляКонтроля/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Функция ТипОбъекта_Справочник()
	Возврат Объект.ТипОбъекта = Перечисления.НСИТипыОбъектов.Справочник;
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеФормы()
	
	ВидимостьЭлементов = ТипОбъекта_Справочник();
	Элементы.ГруппаЭлементыСправочника.Видимость = ВидимостьЭлементов;
	Элементы.ГруппаСоставКлючаПоиска.Видимость = ВидимостьЭлементов;
	Элементы.ГруппаОтбор.Видимость = ВидимостьЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПостроительСервер()
	
	Попытка
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
		
		ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
		ИсточникДанных.Имя = "ИсточникДанных";
		ИсточникДанных.ТипИсточникаДанных = "Local";
		
		НаборДанныхЗапрос = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанныхЗапрос.Имя = "НаборДанных";
		НаборДанныхЗапрос.ИсточникДанных = "ИсточникДанных";
		//->Lexa141105
		//НаборДанныхЗапрос.Запрос = "ВЫБРАТЬ Разрешенные _.* ИЗ Справочник." + Объект.НаименованиеВСистемеКонтролере + " КАК _ ";//непонятно!!! нужно разбираться
		НаборДанныхЗапрос.Запрос = "ВЫБРАТЬ Разрешенные _.* ИЗ Справочник." + Объект.Наименование + " КАК _ ";
		
		//ИсточникДоступныхНастроекКомпоновкиДанных = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных);
		//КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		//КомпоновщикНастроекКомпоновкиДанных.Инициализировать(ИсточникДоступныхНастроекКомпоновкиДанных);
		
		АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
		КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		//<-Lexa
		
		Если Не ПустаяСтрока(Объект.Отбор) Тогда
			КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(ЗначениеИзСтрокиВнутр(Объект.Отбор));
		КонецЕсли;
		
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПостроитель()
	
	Если ТипОбъекта_Справочник() Тогда
		
		ОбновитьПостроительСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьОтображениеФормы();
	ОбновитьПостроитель();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если КомпоновщикНастроекКомпоновкиДанных.Настройки.Отбор.Элементы.Количество() > 0 Тогда
		Объект.Отбор = ЗначениеВСтрокуВнутр(КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки());
	Иначе
		Объект.Отбор = "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	ОбновитьОтображениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОтборВСистемахПользователях(Команда)
	
	ТекущаяСтрока = Элементы.СистемыПользователи.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОтбора = Неопределено;
	
	ПараметрыФормы = Новый Структура ("НаименованиеОбъекта, ТекстОтбора", Объект.Наименование, ТекущаяСтрока.Отбор);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ФормаОтбора = ПолучитьФорму("Справочник.НСИОбъектыДляКонтроля.Форма.ФормаОтбора", ПараметрыФормы);
	ТекстОтбора = ФормаОтбора.ОткрытьМодально();
	ОтборВСистемахПользователяхЗавершение(ТекстОтбора,Новый Структура("ТекущаяСтрока",ТекущаяСтрока));
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение ИЛИ ТонкийКлиент  Тогда
	ОткрытьФорму("Справочник.НСИОбъектыДляКонтроля.Форма.ФормаОтбора", ПараметрыФормы,,,,, Новый ОписаниеОповещения("ОтборВСистемахПользователяхЗавершение", ЭтотОбъект, Новый Структура("ТекущаяСтрока", ТекущаяСтрока)), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВСистемахПользователяхЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ТекущаяСтрока = ДополнительныеПараметры.ТекущаяСтрока;
    
    ТекстОтбора = Результат;
    
    Если Не ТекстОтбора = Неопределено Тогда
        ТекущаяСтрока.Отбор = ТекстОтбора;
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Результат = ПолучитьФорму("Справочник.НСИОбъектыДляКонтроля.Форма.ФормаВыбораОбъектаМетаданных").ОткрытьМодально();
	Если Не Результат = Неопределено И Не Результат = КодВозвратаДиалога.Отмена Тогда
		ВыбТипОбъекта = Результат.ТипОбъекта;
		Если ВыбТипОбъекта = "Перечисления" Тогда
			Объект.ТипОбъекта = ПредопределенноеЗначение("Перечисление.НСИТипыОбъектов.Перечисление");
		ИначеЕсли ВыбТипОбъекта = "Справочники" Тогда
			Объект.ТипОбъекта = ПредопределенноеЗначение("Перечисление.НСИТипыОбъектов.Справочник");
		КонецЕсли;
		
		Объект.Наименование = Результат.Наименование;
		Объект.НаименованиеВСистемеКонтролере = Объект.Наименование;
		
		ОбновитьОтображениеФормы();
		
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСКПЗначениямиПоумолчанию(Команда)
	НС = Объект.СоставКлючаПоиска.Добавить();
	НС.ИмяПоля = "Наименование";
	НС.ИмяПоляВКонтролере = "Наименование";
	НС.GUID = Ложь;
	
	НС = Объект.СоставКлючаПоиска.Добавить();
	НС.ИмяПоля = "GUID";
	НС.ИмяПоляВКонтролере = "GUID";
	НС.GUID = Истина;
КонецПроцедуры

&НаСервере
Функция СписокВведенныхРеквизитов()
	Возврат Объект.СоставКлючаПоиска.Выгрузить(,"ИмяПоля");
КонецФункции

&НаКлиенте
Процедура СоставКлючаПоискаИмяПоляНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СписокВыбора = Элемент.СписокВыбора;
	СписокВыбора.Очистить();
	
	СоставКлючаПоискаСервер(СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКлючаПоискаИмяПоляПриИзменении(Элемент)
	
	ТекСтрока = Элементы.СоставКлючаПоиска.ТекущиеДанные;
	ТекСтрока.ИмяПоляВКонтролере = ТекСтрока.ИмяПоля;
	
	Если ТекСтрока.ИмяПоля = "GUID" Тогда
		ТекСтрока.GUID = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоставКлючаПоискаСервер(СписокВыбора)
	
	Реквизиты = СписокВведенныхРеквизитов();	
	
	Если Реквизиты.Найти("GUID") = Неопределено Тогда
		СписокВыбора.Добавить("GUID");
	КонецЕсли;
	
	Попытка
		Для Каждого рекв Из Метаданные.Справочники[Объект.Наименование].СтандартныеРеквизиты Цикл
			ТипРеквизита = Строка(рекв.Тип);
			Если (ТипРеквизита = "Строка" Или ТипРеквизита = "Число" Или ТипРеквизита = "Дата" Или ТипРеквизита = "Булево") И Реквизиты.Найти(рекв.Имя) = Неопределено Тогда
				СписокВыбора.Добавить(рекв.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого рекв Из Метаданные.Справочники[Объект.Наименование].Реквизиты Цикл
			ТипРеквизита = Строка(рекв.Тип);
			Если (ТипРеквизита = "Строка" Или ТипРеквизита = "Число" Или ТипРеквизита = "Дата" Или ТипРеквизита = "Булево") И Реквизиты.Найти(рекв.Имя) = Неопределено Тогда
				СписокВыбора.Добавить(рекв.Имя);
			КонецЕсли;
		КонецЦикла;

	Исключение
		
	КонецПопытки;

КонецПроцедуры

//->Lexa 141114
&НаКлиенте
Процедура ОбъектДляКонтроляРодительПриИзменении(Элемент)
	ОбъектДляКонтроляРодительПриИзмененииНаСервере();
	ОбновитьОтображениеФормы();
КонецПроцедуры

&НаСервере
Процедура ОбъектДляКонтроляРодительПриИзмененииНаСервере()
	Если Объект.ОбъектДляКонтроляРодитель.ТипОбъекта = Перечисления.НСИТипыОбъектов.Справочник Тогда
		Объект.Наименование = Объект.ОбъектДляКонтроляРодитель.Наименование;
		Объект.НаименованиеВСистемеКонтролере = Объект.Наименование;
		
	Иначе
		Объект.ОбъектДляКонтроляРодитель = Справочники.НСИОбъектыДляКонтроля.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры
//<-Lexa
